In [3]:
import pandas as pd

In [6]:
the_world_ranking = pd.read_csv('../data/the_world_ranking.csv')
the_world_ranking.head()

,Rank,Name,Overall,Teaching,Research Environment,Research Quality,Industry,International Outlook,col_0
0,1,University of Oxford\r\nUnited Kingdom,98.2,97.2,100.0,97.7,99.9,96.4,NaN
1,2,Massachusetts Institute of Technology\r\nUnite...,97.7,99.2,95.3,99.6,100.0,91.9,NaN
2,=3,Princeton University\r\nUnited States,97.2,98.2,97.3,99.0,98.0,85.4,NaN
3,=3,University of Cambridge\r\nUnited Kingdom,97.2,96.2,99.9,97.1,87.6,96.3,NaN
4,=5,Harvard University\r\nUnited States,97.1,95.9,100.0,98.9,86.7,88.3,NaN

In [7]:
df = the_world_ranking.copy()


df[['University Name', 'Country']] = df['Name'].str.split(pat='\n', n=1, expand=True)
df['University Name'] = df['University Name'].str.strip()
df['Country'] = df['Country'].str.strip()


df['Overall Rank or Rank Band'] = df['Rank'].astype(str).str.replace(r'^=', '', regex=True).str.strip()

df = df.rename(columns={
    'Teaching': 'Teaching Score',
    'Research Environment': 'Research Environment Score',
    'Research Quality': 'Research Quality Score',
    'International Outlook': 'International Outlook Score',
    'Industry': 'Industry or Income Score'
})

cols = [
    'University Name',
    'Country',
    'Overall Rank or Rank Band',
    'Teaching Score',
    'Research Environment Score',
    'Research Quality Score',
    'International Outlook Score',
    'Industry or Income Score'
]
cleaned_rankings = df[cols]

cleaned_rankings.head()

,University Name,Country,Overall Rank or Rank Band,Teaching Score,Research Environment Score,Research Quality Score,International Outlook Score,Industry or Income Score
0,University of Oxford,United Kingdom,1,97.2,100.0,97.7,96.4,99.9
1,Massachusetts Institute of Technology,United States,2,99.2,95.3,99.6,91.9,100.0
2,Princeton University,United States,3,98.2,97.3,99.0,85.4,98.0
3,University of Cambridge,United Kingdom,3,96.2,99.9,97.1,96.3,87.6
4,Harvard University,United States,5,95.9,100.0,98.9,88.3,86.7

In [8]:
initial_count = len(cleaned_rankings)
cleaned_rankings.dropna(subset=cols, inplace=True)
cleaned_rankings.reset_index(drop=True, inplace=True)
print(f"Removed {initial_count - len(cleaned_rankings)} rows with null values")
cleaned_rankings.head()

Removed 928 rows with null values

C:\Users\MIS\AppData\Local\Temp\ipykernel_15024\1939398974.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_rankings.dropna(subset=cols, inplace=True)

,University Name,Country,Overall Rank or Rank Band,Teaching Score,Research Environment Score,Research Quality Score,International Outlook Score,Industry or Income Score
0,University of Oxford,United Kingdom,1,97.2,100.0,97.7,96.4,99.9
1,Massachusetts Institute of Technology,United States,2,99.2,95.3,99.6,91.9,100.0
2,Princeton University,United States,3,98.2,97.3,99.0,85.4,98.0
3,University of Cambridge,United Kingdom,3,96.2,99.9,97.1,96.3,87.6
4,Harvard University,United States,5,95.9,100.0,98.9,88.3,86.7

In [9]:
cleaned_rankings['Numeric Rank'] = cleaned_rankings['Overall Rank or Rank Band'].str.extract(r'(\d+)', expand=False).astype(int)
cleaned_rankings.head()

C:\Users\MIS\AppData\Local\Temp\ipykernel_15024\2564189242.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_rankings['Numeric Rank'] = cleaned_rankings['Overall Rank or Rank Band'].str.extract(r'(\d+)', expand=False).astype(int)

,University Name,Country,Overall Rank or Rank Band,Teaching Score,Research Environment Score,Research Quality Score,International Outlook Score,Industry or Income Score,Numeric Rank
0,University of Oxford,United Kingdom,1,97.2,100.0,97.7,96.4,99.9,1
1,Massachusetts Institute of Technology,United States,2,99.2,95.3,99.6,91.9,100.0,2
2,Princeton University,United States,3,98.2,97.3,99.0,85.4,98.0,3
3,University of Cambridge,United Kingdom,3,96.2,99.9,97.1,96.3,87.6,3
4,Harvard University,United States,5,95.9,100.0,98.9,88.3,86.7,5

In [11]:
cleaned_rankings[500:510]

,University Name,Country,Overall Rank or Rank Band,Teaching Score,Research Environment Score,Research Quality Score,International Outlook Score,Industry or Income Score,Numeric Rank
500,Wake Forest University,United States,401–500,38.0,23.2,80.5,38.7,92.3,401
501,Washington State University,United States,401–500,37.3,33.1,67.8,56.2,82.8,401
502,York University,Canada,401–500,29.3,33.2,71.5,86.0,72.3,401
503,Zayed University,United Arab Emirates,401–500,21.8,21.7,85.8,73.7,59.5,401
504,Alfaisal University,Saudi Arabia,501–600,24.2,19.5,73.7,97.2,50.4,501
505,American University of Sharjah,United Arab Emirates,501–600,20.9,28.7,73.0,87.5,49.7,501
506,Auckland University of Technology,New Zealand,501–600,22.6,22.8,73.6,91.3,49.8,501
507,Banaras Hindu University,India,501–600,49.9,18.0,67.8,27.6,31.0,501
508,Bangor University,United Kingdom,501–600,28.3,26.0,70.3,87.1,63.2,501
509,Ca’ Foscari University of Venice,Italy,501–600,38.0,38.0,53.2,65.9,61.3,501

In [13]:
cleaned_rankings.to_csv('../data/cleaned_world_ranking.csv', index=False)